app/controllers/admin/schemes_controller.rb

  def index
    @schemes = Scheme.all.order :name
---
SELECT "schemes".* FROM "schemes" ORDER BY "schemes"."name" ASC

  def create
    @scheme = Scheme.new( scheme_params )
    @scheme.save
---
INSERT INTO "schemes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Foo"], ["created_at", "2018-11-27 12:43:21.881418"], ["updated_at", "2018-11-27 12:43:21.881418"]]

  def update
    @scheme.update scheme_params
---
UPDATE "schemes" SET "name" = $1, "updated_at" = $2 WHERE "schemes"."id" = $3  [["name", "Foos"], ["updated_at", "2018-11-27 13:07:49.476018"], ["id", 1]]

  def load_scheme
    @scheme = Scheme.find params[:id]
---
SELECT  "schemes".* FROM "schemes" WHERE "schemes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]