app/views/houses/show.html.haml

SELECT "rooms".* FROM "rooms" WHERE "rooms"."house_id" = $1  [["house_id", 6]]
---
%ul
  - @house.ground_floor_rooms.each do |r|